; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-36)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 22 of 36
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 36
3. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 23 of 36
4. (pick ball20 roomb right)
   deleted: (at ball20 roomb) (free right)
   added: (carry ball20 right)
   goals met: 23 of 36
5. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 23 of 36
6. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 24 of 36
7. (pick ball30 room3 left)
   deleted: (at ball30 room3) (free left)
   added: (carry ball30 left)
   goals met: 24 of 36
8. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 24 of 36
9. (drop ball30 room4 left)
   deleted: (carry ball30 left)
   added: (at ball30 room4) (free left)
   goals met: 25 of 36
10. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 25 of 36
11. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 25 of 36
12. (pick ball18 roomb right)
   deleted: (at ball18 roomb) (free right)
   added: (carry ball18 right)
   goals met: 25 of 36
13. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 25 of 36
14. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 26 of 36
15. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 27 of 36
16. (pick ball29 room3 left)
   deleted: (at ball29 room3) (free left)
   added: (carry ball29 left)
   goals met: 27 of 36
17. (pick ball28 room3 right)
   deleted: (at ball28 room3) (free right)
   added: (carry ball28 right)
   goals met: 27 of 36
18. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 27 of 36
19. (drop ball28 room4 right)
   deleted: (carry ball28 right)
   added: (at ball28 room4) (free right)
   goals met: 28 of 36
20. (drop ball29 room4 left)
   deleted: (carry ball29 left)
   added: (at ball29 room4) (free left)
   goals met: 29 of 36
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 29 of 36
22. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 29 of 36
23. (pick ball16 roomb right)
   deleted: (at ball16 roomb) (free right)
   added: (carry ball16 right)
   goals met: 29 of 36
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 29 of 36
25. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 30 of 36
26. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 31 of 36
27. (pick ball27 room3 left)
   deleted: (at ball27 room3) (free left)
   added: (carry ball27 left)
   goals met: 31 of 36
28. (pick ball26 room3 right)
   deleted: (at ball26 room3) (free right)
   added: (carry ball26 right)
   goals met: 31 of 36
29. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 31 of 36
30. (drop ball26 room4 right)
   deleted: (carry ball26 right)
   added: (at ball26 room4) (free right)
   goals met: 32 of 36
31. (drop ball27 room4 left)
   deleted: (carry ball27 left)
   added: (at ball27 room4) (free left)
   goals met: 33 of 36
32. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 33 of 36
33. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 33 of 36
34. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 33 of 36
35. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 33 of 36
36. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 34 of 36
37. (pick ball25 room3 right)
   deleted: (at ball25 room3) (free right)
   added: (carry ball25 right)
   goals met: 34 of 36
38. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 34 of 36
39. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 34 of 36
40. (drop ball25 room4 right)
   deleted: (carry ball25 right)
   added: (at ball25 room4) (free right)
   goals met: 35 of 36
41. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 36 of 36
